verification/runs/F4_runs/cyl/M8.0/coarse/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-1.000000000000 0.000000000000 -0.005000000000)
    (-0.258819045103 0.965925826289 -0.005000000000)
    (-0.439992376674 1.642073904691 -0.005000000000)
    (-1.700000000000 0.000000000000 -0.005000000000)
    (-1.000000000000 0.000000000000 0.005000000000)
    (-0.258819045103 0.965925826289 0.005000000000)
    (-0.439992376674 1.642073904691 0.005000000000)
    (-1.700000000000 0.000000000000 0.005000000000)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 20 1) simpleGrading (1 8.0 1)
);

edges
(
    arc 0 1 (-0.793353340291 0.608761429009 -0.005000000000)
    arc 4 5 (-0.793353340291 0.608761429009 0.005000000000)
    arc 3 2 (-1.348700678495 1.034894429315 -0.005000000000)
    arc 7 6 (-1.348700678495 1.034894429315 0.005000000000)
);

boundary
(
    cylinder
    {
        type wall;
        faces ((0 1 5 4));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    farfield
    {
        type patch;
        faces ((2 3 7 6));
    }
    bottom
    {
        type symmetryPlane;
        faces ((3 0 4 7));
    }
    defaultFaces
    {
        type empty;
        faces ();
    }
);

mergePatchPairs
(
);
